shabbat_light = \
'Зажигание субботних свечей\n\n' \
'Субботние свечи зажигают за 18 минут до захода солнца.\n\n'\
'Перед зажиганием свечей принято давать хотя бы несколько монет на благотворительные цели (в цдаку)\n\n'\
'Зажигание свечей происходит таким образом: сначала зажигают свечи, потом прикрывают глаза ладонями и произносят благословение:\n\n'\
'Борух Ато Адой-ной Элой-эйну Мэлэх Оойлом Ашер Кидешону Бэмицвойсов Вэцивону Лэадлик Нэйр Шель Шаббос Койдеш.\n\n'\
'("Благословен Ты, Г-сподь, Б-г наш, Владыка Вселенной, освятивший нас Своими заповедями и повелевший нам зажигать свечу Священной Субботы".)\n\n'\
'Замужние женщины зажигают, как минимум, две свечи. Существует обычай прибавлять по одной свече на каждого ребенка в семье.\n'\
'Женщина автоматически принимает на себя Субботу с зажиганием свечей. И после этого она уже не может делать никакой работы, запрещенной в Шаббат.\n'\
'Если женщина по серьезной причине не может зажечь субботние свечи, то это за неё могут сделать муж или любой другой член семьи.\n\n'\
'<a href="https://www.youtube.com/watch?v=7hOS_taRDgk">Видеоинструкция по зажиганию субботних свечей</a>'

avdala = \
'Для проведения Авдалы Вам понадобятся: \n' \
'1. Вино или виноградный сок (если нет - можно использовать «хемар медина» (букв. «напиток страны») - чай, кофе, сок (апельсиновый, яблочный, грейпфрутовый), пиво.)\n' \
'2. Переплетенная свеча (в ней должны быть минимум 2 фитиля. Если такой нет - можно использовать 2 обычные свечи, поднесенные фитилями друг к другу, чтобы 2 огня становились одним. ' \
'В крайнем случае - 2 зажженные спички поднесенные друг к другу (можно зажечь только на время благословения над огнем).\n' \
'3. Бесамим (благовония). Например гвоздика, корица, зерна кофе и тд.\n' \
'4. Сидур или текст благословения Авдалы (текст можно найти ниже).\n\n' \
'Как делать Авдалу?\n\n' \
'Наполняют бокал вина(чая) так, чтобы часть жидкости вылилась через края. Берут бокал в правую руку, после этого берут его левой рукой ' \
'и ставят на ладонь правой. Затем произносят:\n\n' \
'ИНЭ ЭЛЬ ЕШУАТИ ЭВТАХ ВЕЛО ЭФХАД КИ ОЗИ ВЕЗИМРАТ Я АДОНАЙ ВАЕИ ЛИ ЛИШУА. \n' \
'УШЕАВТЭМ МАИМ БЕСАСОН МИМААЙНЭЙ АЕШУА ЛАДОНАЙ АЕШУА АЛЬ АМХА ' \
'ВИРХАТЭХА СЭЛА. АДОНАЙ ЦВАОТ ИМАНУ МИСГАВ ЛАНУ ЭЛОЭЙ ЯАКОВ СЭЛА. \n' \
'АДОНАЙ ЦВАОТ АШРЭЙ АДАМ БОТЭАХ БАХ. АДОНАЙ ОШИА АМЭЛЭХ ЯАНЭНУ ' \
'ВЕЙОМ КОРЭНУ. \n\n' \
'Вот, Бог — спасение мое: я уповаю и не страшусь, ибо сила моя — Бог Господь и Ему песнь моя, и Он даровал мне спасение. И с радостью будете вы черпать воду из источников спасения. ' \
'От Господа наше спасение! Да пребудет на народе Твоем — благословение Твое вовеки! Господь воинств с нами, наш оплот вовеки — Бог Яакова! Господь воинств, счастлив человек, полагающийся на Тебя! ' \
'Господи, помоги! Владыка ответит нам в день, когда воззовем мы.\n\n' \
'Все вместе произносят следующую фразу:\n\n' \
'ЛАЙЕУДИМ АЙТА ОРА ВЕСИМХА ВЕСАСОН ВИКАР, КЭН ТИЕ ЛАНУ, \n\n' \
'И настала для иудеев (пора) просвета и радости, и веселья, и почета. \n\n' \
'А затем ведущий продолжает: \n\n' \
'КОС ЙЕШУАОТ ЭСА УВШЭМ АДОНАЙ ЭКРА. \n\n' \
'Чашу спасения подниму и имя Господа призову. \n\n' \
'САВРИ, МАРАНАН. \n\n' \
'Внемлите, господа мои!\n\n' \
'На вино: \n' \
'БАРУХ АТА АДОНАЙ ЭЛОЙЭНУ МЭЛЭХ \n' \
'АОЛАМ БОРЭ ПРИ АГАФЭН. \n\n' \
'Благословен Ты, Господь, Бог наш, Владыка \n' \
'Владыка вселенной, сотворивший плод виноградной лозы! \n\n' \
'На чай, сок, пиво: \n' \
'БАРУХ АТА АДОНАЙ ЭЛОЙЭНУ МЭЛЭХ АОЛАМ ШЭАКОЛЬ НИЯ БИДВАРО. \n\n' \
'Благословен Ты, Господь, Бог наш, Владыка \n' \
'Владыка вселенной, по Чьему слову возникло все существующее!\n\n' \
'На благовония:\n' \
'БАРУХ АТА АДОНАЙ ЭЛОЙЭНУ МЭЛЭХ АОЛАМ БОРЭ МИНЭЙ ВЕСАМИМ.\n\n' \
'Благословен Ты, Господь, Бог наш, Владыка вселенной, сотворивший ароматные вещества\n\n' \
'После произнесения благословения необходимо вдохнуть аромат благовоний.\n' \
'На пламя свечи:\n' \
'БАРУХ АТА АДОНАЙ ЭЛОЙЭНУ МЭЛЭХ АОЛАМ БОРЭ МЕОРЭЙ АЭШ.\n\n' \
'Благословен Ты, Господь, Бог наш, Владыка вселенной, сотворивший свет огней.\n\n' \
'После произнесения благословения необходимо поднести руки к свече и в её свете посмотреть на свои ногти.\n\n' \
'Завершают авдалу:\n' \
'БАРУХ АТА АДОНАЙ ЭЛОЙЭНУ МЭЛЭХ АОЛАМ АМАВДИЛЬ БЭН КОДЭШ ЛЕХОЛЬ ' \
'БЭН ОР ЛЕХОШЭХ, БЭН ЙИСРАЭЛЬ ЛААМИМ, БЭН ЙОМ АШЕВИИ ЛЕШЭШЭТ ЙЕМЭЙ ' \
'АМААСЭ. БАРУХ АТА АДОНАЙ АМАВДИЛЬ БЭН КОДЭШ ЛЕХОЛЬ. \n\n' \
'Благословен Ты, Господь, Бог наш, Владыка вселенной, отделивший святое от будничного, свет от тьмы, Израиль ' \
'от других народов, седьмой день от шести рабочих дней. Благословен Ты, Господь, отделивший святое от ' \
'будничного.\n\n' \
'После этого садятся и выпивают бокал с вином (или другим напитком, над которым делалось благословение). Затем необходимо окунуть свечу в тарелку и затушить ее остатком напитка. ' \
'Есть традиция, обмакивать в эту винно-восковую жидкость мизинчики и мазать веки, виски и карманы.\n\n' \
'<a href="https://www.youtube.com/watch?v=_8jVs-HGhhM">Видеоинструкция по проведению Авдалы</a>' 

promo_text = '\n\nБольше видео на нашем <a href="https://www.youtube.com/KolelTora">YouTube</a> и <a href="https://www.facebook.com/KolelToraRu/">Facebook</a>'


annonce_sub_answer_text = 'Хотите получать анонсы онлайн лекций и мероприятий?'


welcome_text = 'Добро пожаловать! Брухим аБаим!\n' \
                        'Наш бот постоянно пополняется новыми функциями. Например, Вы можете узнать время Шаббата, получить ссылки на уроки Торы и т.д.\n' \
                        'Все, что доступно в данный момент Вы можете увидеть нажав на кнопку "меню".\n' \
                        'Будем рады Вашему отзыву или пожеланиям - кнопка "Отзыв"'

about_us_text = 'Колель Тора - сеть ежедневного изучения Торы в странах СНГ и Европы\n' \
            'Мы работаем при еврейских общинах во множестве городов и онлайн.\n\n'   \
            'Наши страницы в соцсетях\n'  \
            'https://www.facebook.com/KolelToraRu/\n'  \
            'https://www.youtube.com/KolelTora' 